[
    {
        "name": "Naruto Uzumaki",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/naruto.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/naruto.png",
        "description": "Naruto was born as the son of the Fourth Hokage, Minato Namikaze, and Kurama's second jinchūriki, Kushina Uzumaki. Naruto's parents named him after the main character of Jiraiya's first book, thus making the Sannin his godfather. Prior to Naruto's birth, his parents and the Third Hokage Hiruzen Sarutobi feared that his birth would break the seal which kept Kurama in Kushina. The plan to ensure it did not occur was for Kushina to be taken to a top-secret location outside the village with Biwako Sarutobi and Taji as her midwives, a few ANBU as security, and Minato to keep the seal in place. However, word of Kushina giving birth reached a masked ninja who intended to take the fox for his own evil ends. Killing the midwives and ANBU, the masked man took the newborn Naruto hostage to keep Minato away from Kushina so the seal can be shattered."
    },
    {
        "name": "Sasuke Uchiha",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/sasuke.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/sasuke.jpg",
        "description": "Sasuke is the second and youngest son of the Konoha Military Police Force captain and Uchiha clan head: Fugaku Uchiha, and his wife Mikoto. Mikoto named him after the father of the Third Hokage in hopes that he would grow up to be a great ninja like his namesake. As a child, Sasuke grew up in the shadow of his older brother, Itachi Uchiha who was an acknowledged prodigy viewed by the Uchiha clan as a genius, and whose work would further strengthen the bonds between the village and the clan. Sasuke's father in particular took an active interest in Itachi, thereby neglecting Sasuke. Itachi, on the other hand, was rather ambivalent and full of oddly conflicting undercurrents, acknowledging Sasuke by taking interest in his progress as a ninja and spending time playing with him when even their father did not. Even after Sasuke enrolled in the Academy, he was still unable to escape Itachi's shadow. Despite consistently scoring at the top of every class, Sasuke failed to receive any recognition from his father, who defined Sasuke's success only in terms of his older brother. Itachi acknowledged the rivalry Sasuke felt telling him: \"We are brothers. I am the wall you must climb over, so you and I will continue to exist together.\" Nevertheless, Itachi deeply cared for his younger brother and Sasuke looked up to Itachi, wanting to be more like him."
    },
    {
        "name": "Sakura Haruno",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/sakura.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/sakura.jpg",
        "description": "During her early years in the Academy, Sakura was frequently bullied by others due to her large forehead. To try and combat this, Sakura used her bangs to hide her forehead, fuelling the other kids' teasing by indicating she was sensitive about it. Ino Yamanaka, realising this, helped Sakura by giving her a red ribbon that she used as a way of drawing attention to the cuter features of her forehead, which helped Sakura overcome her insecurity. The two became best friends and Sakura grew more confident, developing her own unique personality under Ino's guidance. In the anime, one day about five years ago while searching for Ino to have lunch with, she spots her, along with Shikamaru Nara and Chōji Akimichi stealing bits of food from others. Curious as to what they are doing, she follows them, discovering that they are bringing the food to a mysterious young child named Yota. Later, despite her genuine appreciation of for Ino's friendship, Sakura felt that she was living in Ino's shadow and longed to prove herself as Ino's equal. Later, when Sakura found out that Ino also had a crush on Sasuke Uchiha, Sakura ended their friendship so that they could compete for Sasuke's love, thus beginning a bitter rivalry between the two."
    },
    {
        "name": "Kakashi Hatake",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/kakashi.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/kakashi.jpg",
        "description": "Kakashi is the son of Sakumo Hatake, a genius renowned as \"Konoha's White Fang\". Not much is known of his mother other than that she died at a young age. Sakumo fell into disgrace after choosing to save his comrades rather than complete an important mission, which caused the nation and the village to suffer a great loss. Dishonoured, Sakumo took his own life after suffering a deep depression and drop in his skills; this experience made Kakashi determined to lead his life strictly by the ninja code. Hailed as a prodigy, because of his great intelligence, skill, and aptitude, at five years old he graduated from the Academy in a single year at the top of his class, eventually joining a team alongside Obito Uchiha and Rin Nohara under Minato Namikaze's command. He later became part of a one-sided rivalry with Might Guy. In the anime, Guy first approached Kakashi while he was reading, quickly announced his desire to challenge the prodigy. While initially Kakashi was completely indifferent to the overzealous Guy's request, Guy continued to follow Kakashi around and challenge him. Eventually, Kakashi gave in to Guy's request, beating Guy in every challenge, including various forms of marksmanship, taijutsu combat, and even physical comparison. Despite these losses, Guy became only more determined to defeat Kakashi. Seemingly warming up to Guy, he continued to accept Guy's various challenges (including eating contests and Rock, Paper, Scissors), ultimately giving Kakashi a record of 49 wins (50 in the anime) and 50 losses. A year later, Kakashi became chūnin after facing and defeating Might Guy during the third stage of the Chūnin Exams"
    },
    {
        "name": "Neji Hyūga",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/neji.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/neji.png",
        "description": "Neji was born into the Branch House of the Hyūga clan to Hizashi, the twin brother of the clan's current head Hiashi Hyūga. When Hinata, the heiress apparent, turned three years old, as customary Neji's previously unmarked forehead was branded with the Hyūga Main Family's Juinjutsu by his uncle Hiashi. All Branch House members carry this cursed seal, and Neji believed it to be a symbol that one lives only to serve, and protect the Main House.Neji's father, was well aware of Neji's natural talent, and he was frustrated that despite Neji's tremendous skill, he still carried the fate of a servant. Often times when contemplating this fate, Hizashi's anger would subconsciously turn outwards; consequently, he was punished through Hiashi's activation of his curse seal who noted that he would no longer tolerate such animosity. Around this time, the Konoha and Kumogakure had signed an alliance treaty. However, the treaty only served as a means into Konoha and a way to lower the village's guard so the Head Ninja of Kumogakure could abduct Hinata and steal the secrets of the Byakugan. This attempt failed, however, as Hiashi intervened and killed the man within moments.."
    },
    {
        "name": "Chōji Akimichi",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/choji.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/choji.png",
        "description": "Chōji was born into the Akimichi clan, and is slated to become the Sixteenth head of the Akimichi (秋道16代目当主, Akimichi Jūrokudaime Tōshu) after his father, Chōza. When Chōji was younger, he was often put down for not being good at a child's game called \"Ninja\", which appears to be a cross between tag and hide and seek, often employing the use of shuriken made out of cardboard and sticks. His peers would always berate him, telling him that any team that he was on was bound to lose. One day, they simply refused to let him play at all. However, Shikamaru stuck up for him, saying that the teams would be uneven if Chōji didn't join them. This gave Chōji a little hope, although, in the end, they still refused to let him play."
    },
    {
        "name": "Gaara",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/garaa.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/garaa.jpg",
        "description": "Gaara is the third and youngest child of the Fourth Kazekage and Karura, and the younger brother of Temari and Kankurō. Before Gaara's birth, his father had Chiyo seal Shukaku within him, in hopes that Gaara would become the ultimate weapon for Sunagakure as he was the only one of the Kazekage's three children to be compatible with the beast. He was born premature and therefore, was an unusually small and frail infant. Before she died, Karura passionately held her son, vowing to always protect him. Gaara was trained in ninjutsu by his father, but mainly raised by his maternal uncle, Yashamaru."
    },
    {
        "name": "Hinata Hyūga",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/hinata.jpg",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/hinata.jpg",
        "description": "Hinata is the elder daughter of the Hyūga clan head, Hiashi Hyūga, and as the first-born, was the heiress-apparent to the clan's main house. However, she apparently lost this position to her younger sister Hanabi, as Hinata was deemed a failure by their father because of her lack of self confidence. When she was young she was kidnapped by a head ninja from Kumogakure, who under the guise of striking a peace treaty with Konoha, had actually been sent there to steal the Byakugan. Her father killed the would-be kidnapper to save her, but Kumo demanded compensation in the form of Hiashi's dead body due to having signed a peace treaty with the village only moments before. This ultimately resulted in the death of Hinata's uncle, Hizashi Hyūga, who sacrificed himself in order to protect his clan and village. This incident was particularly significant in shaping Hinata's early relationship with her cousin, Neji Hyūga."
    },
    {
        "name": "Kiba Inuzuka",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/kiba.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/kiba.png",
        "description": "At a very young age, Akamaru was given to Kiba by his mother, Tsume, and the two became very close soon afterwards. Before entering the Academy, Kiba and Akamaru played together a great deal, resulting in Tsume getting angry because they weren't training enough. During Kiba's time at the Academy, he often cut class with Akamaru, stating that he wasn't suited to sit still at a desk, or otherwise getting into trouble, along with Chōji Akimichi, Shikamaru Nara, and Naruto Uzumaki. Together, these four would skip class and go to the practice hall (not to practice). They thought that it was fun to also test the patience of Iruka Umino, their Academy instructor.At some time in the past, Kiba knew his father; but because of his mother's attitude, Tsume scared him away, leaving him just with her and his sister Hana Inuzuka. Despite this, Kiba stays in a close relationship with his sister and mother, although he seems to agree that Tsume is rather frightening."
    },
    {
        "name": "Rock Lee",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/lee.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/lee.jpg",
        "description": "During his time as a student in the Academy, Lee proved to have no talent for ninjutsu and genjutsu. As he was mocked by his peers because of this, Lee persevered, focusing on taijutsu. When Lee eventually graduated he was added to Team Guy along with Neji Hyūga and Tenten. During the team's first meeting, Lee vowed to become a powerful ninja without using ninjutsu or genjutsu. Neji laughed at him, but their sensei, Might Guy, took a special interest in Lee. He encouraged Lee to keep at it and, in time, began teaching him powerful forms of taijutsu."
    },
    {
        "name": "Shikamaru Nara",
        "thumbnail": "http://fethica.github.io/UITableViewJSON/images/thumbs/shikamaru.png",
        "photo": "http://fethica.github.io/UITableViewJSON/images/profile/shikamaru.jpg",
        "description": "Shikamaru was born into the Nara clan to Shikaku and Yoshino. He has a long-standing friendship with Chōji Akimichi. They met even before joining the Academy, when others ridiculed Chōji for his weight, Shikamaru soon abandoned the game and ended up hanging out with Chōji instead. Because of the kindness Shikamaru has always shown him, Chōji is unwavering in his loyalty to him, and will gladly give his life for Shikamaru.Once they entered the Academy, Shikamaru and Chōji were among their classes' dead-lasts, along with Kiba Inuzuka and Naruto Uzumaki, spending their day pursuing what they deemed to be more interesting pastimes. In Shikamaru's case, he would spend all day sleeping; to Shikamaru, even the very effort of putting pen-to-paper was just too much effort for him to put into it unless he had to. Iruka Umino, their instructor, would give them all the same lecture. In the anime, around this time, Shikamaru, along with Chōji and Ino Yamanaka went searching for a set of kunai Chōji lost. During their search, they met a mysterious young boy named Yota. They soon learned to their amazement that Yota had the ability to manipulate weather, especially through his emotional state. Fearing how the village would respond to an outsider considering how much turmoil it had with the other nations, Shikamaru and the others decided to hide Yota's existance, giving him shelter in a treehouse and regularly bringing him food."
    }
]